/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hurabe <hurabe@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/05/19 15:32:40 by hurabe            #+#    #+#             */
/*   Updated: 2024/09/20 17:05:14 by hurabe           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../push_swap.h"

// この関数は、リストの最後のノードを返す。
// リストの最後までポインタを進めて、最後のノードを見つけて返す。

t_dst	*ft_lstlast(t_dst *dst)
{
	if (!dst)
		return (NULL);
	while (dst->next)
		dst = dst->next;
	return (dst);
}
